of+1806/tutorials/cavity_heatedWalls_differentLambdaEtaPfuns/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 400.0;

boundaryField
{
   
    movingLid
    {
    	type		zeroGradient;
    }
    
    bottomWall
    {
    	type		zeroGradient;
    }
    
    westWall
    {
	type            fixedValue;
	value           uniform 300.0;
    }
    
    eastWall
    {
	type            fixedValue;
	value           uniform 500.0;
    }
    frontAndBack
    {
    	type		empty;
    }
    
}

// ************************************************************************* //
