of+1806/tutorials/cavity_heatedWalls_differentLambdaEtaPfuns/0.orig/tau
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    movingLid
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    bottomWall
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    westWall
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    eastWall
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
